Bwooce/tinygs_nRF52/src/main.cpp
        uint32_t payload_len = MIN(pub->message.payload.len, sizeof(rx_payload) - 1);
        int ret = mqtt_read_publish_payload(client, rx_payload, payload_len);
        if (ret < 0) {
            LOG_ERR("MQTT payload read error: %d", ret);
            break;
        }
        rx_payload[ret] = '\0';

        LOG_INF("MQTT RX [%s] (%d bytes)", rx_topic, ret);
        /* Truncate long payloads for logging — full payload is still parsed */
        if (ret > 0) {
            char saved = 0;
            if (ret > 200) { saved = rx_payload[200]; rx_payload[200] = '\0'; }
            LOG_INF("  payload: %s%s", (char *)rx_payload, ret > 200 ? "..." : "");
            if (saved) { rx_payload[200] = saved; }
        }

        /* Extract command name from topic:
         * tinygs/global/cmnd/XXX or tinygs/user/station/cmnd/XXX */
        const char *cmnd = strstr(rx_topic, "/cmnd/");
        if (cmnd) {
            cmnd += 6;  /* skip "/cmnd/" */
            LOG_INF("  command: %s", cmnd);

            if (strcmp(cmnd, "begine") == 0 ||
                strcmp(cmnd, "batch_conf") == 0) {
                if (radio != nullptr) {
                    /* Store raw payload as modem_conf before parsing
                     * (json_obj_parse modifies the buffer in-place) */
                    size_t conf_len = strlen((char *)rx_payload);
                    if (conf_len < sizeof(tinygs_radio.modem_conf)) {
                        memcpy(tinygs_radio.modem_conf, rx_payload, conf_len + 1);
                    } else {
                        LOG_WRN("modem_conf too large (%zu > %zu), skipped",
                                conf_len, sizeof(tinygs_radio.modem_conf) - 1);
                    }

                    /* Parse begine JSON via Zephyr json.h descriptors */
                    struct tinygs_begine_msg msg;
                    int64_t parsed = tinygs_parse_begine((char *)rx_payload, ret, &msg);
                    if (parsed < 0) {
                        LOG_ERR("begine parse failed");
                    } else {
                        /* Apply radio config from parsed struct */
                        float freq = tinygs_begine_get_freq(&msg);
                        if (freq > 100.0f && freq < 1000.0f) {
                            tinygs_radio.frequency = freq;
                            radio->setFrequency(freq + tinygs_radio.freq_offset / 1e6f);
                        }
                        float bw = tinygs_begine_get_bw(&msg);
                        if (bw > 0.0f) {
                            radio->setBandwidth(bw);
                            tinygs_radio.bw = bw;
                        }
                        if (msg.sf >= 5 && msg.sf <= 12) {
                            radio->setSpreadingFactor(msg.sf);
                            tinygs_radio.sf = msg.sf;
                        }
                        if (msg.cr >= 4 && msg.cr <= 8) {
                            radio->setCodingRate(msg.cr);
                            tinygs_radio.cr = msg.cr;
                        }
                        radio->setSyncWord(msg.sw);
                        radio->setPreambleLength(msg.pl);
                        radio->invertIQ(msg.iIQ);
                        radio->setCRC(msg.crc ? 2 : 0);

                        if (msg.sat) {
                            strncpy(tinygs_radio.satellite, msg.sat,
                                    sizeof(tinygs_radio.satellite) - 1);
                            tinygs_radio.satellite[sizeof(tinygs_radio.satellite) - 1] = '\0';
                        }
                        tinygs_radio.norad = (uint32_t)msg.NORAD;
                    }

                    /* Parse filter (array — not handled by json.h descriptors) */
                    int filt_count = tinygs_parse_filter(
                        tinygs_radio.modem_conf, strlen(tinygs_radio.modem_conf),
                        tinygs_radio.filter, sizeof(tinygs_radio.filter));
                    tinygs_radio.filter_len = (filt_count > 0) ? filt_count : 0;
                    if (filt_count <= 0) tinygs_radio.filter[0] = 0;

                    /* Parse TLE base64 from modem_conf copy (original modified by json_obj_parse) */
                    const char *tlx_p = strstr(tinygs_radio.modem_conf, "\"tlx\":\"");
                    if (tlx_p) {
                        const char *b64_start = tlx_p + 7;
                        const char *b64_end = strchr(b64_start, '"');
                        if (b64_end) {
                            size_t decoded_len = 0;
                            if (base64_decode((uint8_t *)tinygs_radio.tle,
                                              sizeof(tinygs_radio.tle),
                                              &decoded_len,
                                              (const uint8_t *)b64_start,
                                              b64_end - b64_start) == 0
                                && decoded_len == 34) {
                                tinygs_radio.tle_valid = true;
                                tinygs_radio.freq_doppler = 0.0f;
                                LOG_INF("  TLE received (%zu bytes)", decoded_len);
                            } else {
                                tinygs_radio.tle_valid = false;
                            }
                        }
                    } else {
                        tinygs_radio.tle_valid = false;
                    }

                    radio->startReceive();

                    LOG_INF("  → %s %.4fMHz SF%d BW%.1f%s%s",
                            tinygs_radio.satellite,
                            (double)tinygs_radio.frequency,
                            tinygs_radio.sf,
                            (double)tinygs_radio.bw,
                            tinygs_radio.tle_valid ? " TLE" : "",
                            tinygs_radio.filter[0] ? " FLT" : "");
                }
            } else if (strcmp(cmnd, "freq") == 0) {
                /* Direct frequency set (MHz as number) */
                float freq = strtof((char *)rx_payload, NULL);
                if (radio && freq > 100.0f && freq < 1000.0f) {
                    tinygs_radio.frequency = freq;
                    radio->setFrequency(freq + tinygs_radio.freq_offset / 1e6f);
                    radio->startReceive();
                    LOG_INF("  → freq=%.4f MHz (foff=%.0f Hz)",
                            (double)freq, (double)tinygs_radio.freq_offset);
                }
            } else if (strcmp(cmnd, "sat") == 0) {
                /* Select satellite — payload is JSON string with sat name */
                const char *p = strstr((char *)rx_payload, "\"");
                if (p) {
                    const char *end = strchr(p + 1, '"');
                    if (end && (end - p - 1) < (int)sizeof(tinygs_radio.satellite)) {
                        memcpy(tinygs_radio.satellite, p + 1, end - p - 1);
                        tinygs_radio.satellite[end - p - 1] = '\0';
                        LOG_INF("  → satellite: %s", tinygs_radio.satellite);
                    }
                }
            } else if (strcmp(cmnd, "set_pos_prm") == 0) {
                tinygs_handle_set_pos((char *)rx_payload, ret);
            } else if (strcmp(cmnd, "set_name") == 0) {
                extern char device_client_id[13];
                struct tinygs_name_msg name_msg;
                if (tinygs_parse_set_name((char *)rx_payload, ret, &name_msg) == 0) {
                    if (strcmp(name_msg.mac, device_client_id) == 0) {
                        strncpy(cfg_station, name_msg.name, sizeof(cfg_station) - 1);
                        cfg_station[sizeof(cfg_station) - 1] = '\0';
                        tinygs_config_save_station(cfg_station);
                        LOG_INF("  → Renamed to: %s (saved, rebooting)", cfg_station);
                        k_msleep(500);
                        sys_reboot(SYS_REBOOT_COLD);
                    } else {
                        LOG_DBG("  → set_name: MAC mismatch");
                    }
                }
            } else if (strcmp(cmnd, "status") == 0) {
                tinygs_send_status(client, cfg_mqtt_user, cfg_station);
            } else if (strcmp(cmnd, "reset") == 0) {
                LOG_WRN("  → Reset requested by server");
                k_msleep(500);
                sys_reboot(SYS_REBOOT_COLD);
            } else if (strcmp(cmnd, "tx") == 0) {
                LOG_INF("  → TX not supported (tx=false)");
            } else if (strcmp(cmnd, "log") == 0) {
                LOG_INF("  → Server: %s", (char *)rx_payload);
            } else if (strcmp(cmnd, "sleep") == 0 || strcmp(cmnd, "siesta") == 0) {
                LOG_INF("  → Sleep not implemented (Phase 4 power management)");
            } else if (strcmp(cmnd, "foff") == 0) {
                float foff = tinygs_parse_foff((char *)rx_payload, ret,
                                                &tinygs_radio.doppler_tol,
                                                &doppler_interval_ms);
                tinygs_radio.freq_offset = foff;
                if (radio) {
                    radio->setFrequency(tinygs_radio.frequency +
                                        tinygs_radio.freq_offset / 1e6f);
                    radio->startReceive();
                }
                LOG_INF("  → foff=%.0f Hz tol=%.0f Hz refresh=%ums",
                        (double)foff, (double)tinygs_radio.doppler_tol,
                        (unsigned)doppler_interval_ms);
            } else if (strcmp(cmnd, "filter") == 0) {
                int fcount = tinygs_parse_filter((char *)rx_payload, ret,
                                                  tinygs_radio.filter,
                                                  sizeof(tinygs_radio.filter));
                tinygs_radio.filter_len = (fcount > 0) ? fcount : 0;
                LOG_INF("  → filter: %d bytes", tinygs_radio.filter_len);
            } else if (strcmp(cmnd, "update") == 0) {
                LOG_INF("  → OTA update not supported (UF2 bootloader)");
            } else if (strcmp(cmnd, "weblogin") == 0) {
                LOG_INF("  *** TinyGS Web Login URL: %s", (char *)rx_payload);
                LOG_INF("  *** Open this URL to configure auto-tune and other settings");
            } else if (strcmp(cmnd, "sat_pos_oled") == 0) {
                /* Satellite position for world map: [x, y] in 128x64 pixel coords */
                const char *p = strchr((char *)rx_payload, '[');
                if (p) {
                    p++;
                    tinygs_radio.sat_pos_x = strtof(p, (char **)&p);
                    while (*p == ',' || *p == ' ') p++;
                    tinygs_radio.sat_pos_y = strtof(p, NULL);
                }
                LOG_DBG("  → sat_pos: %.0f,%.0f",
                        (double)tinygs_radio.sat_pos_x,
                        (double)tinygs_radio.sat_pos_y);
            } else if (strncmp(cmnd, "frame/", 6) == 0) {
                int frame_num = atoi(cmnd + 6);
                tinygs_display_set_remote_frame(frame_num,
                                                 (const char *)rx_payload, ret);
            } else if (strcmp(cmnd, "frame") == 0) {
                LOG_DBG("  → frame command without number, ignored");
            } else {
                LOG_INF("  → Unhandled command: %s", cmnd);
            }
        }

        if (pub->message.topic.qos == MQTT_QOS_1_AT_LEAST_ONCE) {
            struct mqtt_puback_param ack = { .message_id = pub->message_id };
            mqtt_publish_qos1_ack(client, &ack);
        }
        break;
    }

    case MQTT_EVT_SUBACK:
        LOG_INF("MQTT SUBACK id=%u result=%d",
                evt->param.suback.message_id, evt->result);
        break;

    default:
        LOG_DBG("MQTT event: %d (connected %us)",
                evt->type,
                (unsigned)(now - mqtt_connected_uptime_ms) / 1000);
        break;
    }
}

