Bwooce/tinygs_nRF52/src/main.cpp
    uint32_t cs   = radio_hal.addPin(&lora_cs);
    uint32_t rst  = radio_hal.addPin(&lora_reset);
    uint32_t busy = radio_hal.addPin(&lora_busy);
    uint32_t dio1 = radio_hal.addPin(&lora_dio1);

    /* Run HAL smoke tests before radio init */
    /* HAL smoke tests disabled for production — saves ~1KB flash
     * extern int zephyr_hal_run_tests(ZephyrHal *hal);
     * zephyr_hal_run_tests(&radio_hal); */

    radio_mod = new Module(&radio_hal, cs, dio1, rst, busy);
#if DT_NODE_HAS_COMPAT(LORA_NODE, semtech_sx1262)
    radio = new SX1262(radio_mod);
#elif DT_NODE_HAS_COMPAT(LORA_NODE, semtech_sx1268)
    radio = new SX1268(radio_mod);
#elif DT_NODE_HAS_COMPAT(LORA_NODE, semtech_sx1276)
    radio = new SX1276(radio_mod);
#elif DT_NODE_HAS_COMPAT(LORA_NODE, semtech_sx1278)
    radio = new SX1278(radio_mod);
#endif

    int state = radio->begin();
    if (state == RADIOLIB_ERR_NONE) {
        LOG_INF("Radio: %s initialized (RadioLib)",
                DT_NODE_FULL_NAME(DT_NODELABEL(sx1262)));
    } else {
        LOG_ERR("Radio init failed: %d", state);
        return;
    }

    /* Set default LoRa config — 433MHz, SF10, BW125, CR5
     * This will be overridden by server batch_conf commands */
    state = radio->setFrequency(TINYGS_DEFAULT_FREQ);
    if (state != RADIOLIB_ERR_NONE) {
        LOG_ERR("setFrequency failed: %d", state);
    }
    radio->setSpreadingFactor(10);
    radio->setBandwidth(250.0);
    radio->setCodingRate(5);
    radio->setSyncWord(0x12);

    /* Register DIO1 interrupt callback and start receiving */
    radio->setPacketReceivedAction(lora_rx_callback);
    state = radio->startReceive();
    if (state == RADIOLIB_ERR_NONE) {
        LOG_INF("LoRa listening on %.3f MHz, SF%d, BW%.0f",
                (double)tinygs_radio.frequency, tinygs_radio.sf,
                (double)tinygs_radio.bw);
    } else {
        LOG_ERR("startReceive failed: %d", state);
    }
}

/*
 * Check for received LoRa packets and process them.
 * Called from the main loop. Returns true if a packet was processed.
 */
static bool lora_check_rx(void)
{
    if (!lora_packet_received || radio == nullptr) {
        return false;
    }

    lora_packet_received = false;

    size_t len = radio->getPacketLength();
    if (len == 0 || len > 255) {
        radio->startReceive();
        return false;
    }

    uint8_t data[256];
    int state = radio->readData(data, len);

    float rssi = radio->getRSSI();
    float snr = radio->getSNR();
    float freq_err = radio->getFrequencyError();

    if (state == RADIOLIB_ERR_NONE) {
        lora_rx_count++;
        /* Flash LED1 white on packet RX */
        neopixel_set(0, 10, 0,  30, 30, 30);
        LOG_INF("LoRa RX: %u bytes, RSSI=%.1f, SNR=%.1f, FreqErr=%.1f",
                (unsigned)len, (double)rssi, (double)snr, (double)freq_err);

        /* Apply packet filter if active.
         * filter[0] = count of bytes to match
         * filter[1] = byte position in packet to start matching
         * filter[2..N] = expected byte values */
        if (tinygs_radio.filter[0] > 0) {
            uint8_t count = tinygs_radio.filter[0];
            uint8_t start = tinygs_radio.filter[1];
            bool filtered = false;
            for (uint8_t i = 0; i < count && i + 2 < sizeof(tinygs_radio.filter); i++) {
                if (start + i >= len || data[start + i] != tinygs_radio.filter[2 + i]) {
                    filtered = true;
                    break;
                }
            }
            if (filtered) {
                LOG_DBG("LoRa RX: filtered out (no match at offset %d)", start);
                radio->startReceive();
                return true;
            }
        }

        /* Notify display of packet reception */
        tinygs_display_packet_rx(rssi, snr);

        /* Publish via MQTT if connected */
        if (app_state == STATE_MQTT_CONNECTED) {
            tinygs_send_rx(&mqtt_client, cfg_mqtt_user, cfg_station,
                           data, len, rssi, snr, freq_err);
        }
    } else if (state == RADIOLIB_ERR_CRC_MISMATCH) {
        LOG_WRN("LoRa RX: CRC error, %u bytes", (unsigned)len);
    } else {
        LOG_ERR("LoRa readData failed: %d", state);
    }

    /* Restart reception, turn off RX flash */
    radio->startReceive();
    neopixel_set(0, 10, 0,  0, 0, 0); /* Back to green status, LED1 off */
    return true;
}

/* -------------------------------------------------------------------------- */
/* Main                                                                        */
/* -------------------------------------------------------------------------- */

int main(void)
{
    const struct device *const console_dev = DEVICE_DT_GET(DT_CHOSEN(zephyr_console));
    uint32_t dtr = 0;

    if (device_is_ready(console_dev)) {
        cdc_acm_dte_rate_callback_set(console_dev, baudrate_reset_handler);
    }

    enable_peripherals();

    /* FATFS operations BEFORE USB enable — mount, write, read, unmount.
     * Must complete before USB MSC goes live to avoid concurrent access. */
    setup_usb_storage();

    /* Enable USB composite (CDC ACM console + MSC drive) */
    if (usb_enable(NULL) == 0) {
        LOG_INF("USB active (MSC + CDC ACM)");
    }

    /* Wait briefly for serial monitor to connect */
    for (int i = 0; i < 30 && !dtr; i++) {
        uart_line_ctrl_get(console_dev, UART_LINE_CTRL_DTR, &dtr);
        k_msleep(100);
    }

    LOG_INF("=== TinyGS nRF52 v%u — Thread/MQTT-TLS ===", (unsigned)TINYGS_VERSION);

    /* Log boot/reset reason */
    {
        uint32_t cause = 0;
        hwinfo_get_reset_cause(&cause);
        hwinfo_clear_reset_cause();
        const char *reason = "unknown";
        if (cause & RESET_PIN) reason = "pin reset";
        else if (cause & RESET_SOFTWARE) reason = "software reboot";
        else if (cause & RESET_WATCHDOG) reason = "watchdog";
        else if (cause & BIT(2)) reason = "power-on";  /* RESET_POR */
        else if (cause == 0) reason = "power-on";
        LOG_INF("Boot reason: %s (0x%02x)", reason, cause);
    }

